In [1]:
import pandas as pd
import numpy as np

# Assignment 1: DataFrame Basics

Hi there!

Can you read in the transactions dataset and report on:

* The number of rows and columns
* The names of the columns
* The datatypes of each column

In [2]:
# A common practice is to create a path variable to pass to read_csv
path = "D:/AA/Programming/Data Science/Python/Maven/Data Analysis With Python AND Pandas/Pandas+Course+Resources/Pandas Course Resources/retail/transactions.csv"

In [3]:
transaction = pd.read_csv(path)
transaction

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [422]:
transac_df = pd.read_csv("D:/AA/Programming/Data Science/Python/Maven/Data Analysis With Python AND Pandas/Pandas+Course+Resources/Pandas Course Resources/retail/transactions.csv")
transac_df

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [4]:
transaction.shape

(83488, 3)

In [5]:
transaction.index

RangeIndex(start=0, stop=83488, step=1)

In [6]:
transaction.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [7]:
transaction.axes

[RangeIndex(start=0, stop=83488, step=1),
 Index(['date', 'store_nbr', 'transactions'], dtype='object')]

In [9]:
transaction.dtypes

date            object
store_nbr        int64
transactions     int64
dtype: object

In [10]:
transaction.sample(5)

             date  store_nbr  transactions
18529  2014-02-05         26           670
43101  2015-07-05         36          1203
76131  2017-04-01         23          1262
2584   2013-02-27          8          2751
25162  2014-06-27         33           850

In [13]:
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [14]:
transaction.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [15]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [16]:
transaction.info(show_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [17]:
transaction.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [18]:
transaction.describe().round()

       store_nbr  transactions
count    83488.0       83488.0
mean        27.0        1695.0
std         16.0         963.0
min          1.0           5.0
25%         13.0        1046.0
50%         27.0        1393.0
75%         40.0        2079.0
max         54.0        8359.0

In [19]:
transaction.describe(include = "all")

              date     store_nbr  transactions
count        83488  83488.000000  83488.000000
unique        1682           NaN           NaN
top     2017-08-15           NaN           NaN
freq            54           NaN           NaN
mean           NaN     26.939237   1694.602158
std            NaN     15.608204    963.286644
min            NaN      1.000000      5.000000
25%            NaN     13.000000   1046.000000
50%            NaN     27.000000   1393.000000
75%            NaN     40.000000   2079.000000
max            NaN     54.000000   8359.000000

In [20]:
transaction.describe(include = "all").round()

              date  store_nbr  transactions
count        83488    83488.0       83488.0
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN       27.0        1695.0
std            NaN       16.0         963.0
min            NaN        1.0           5.0
25%            NaN       13.0        1046.0
50%            NaN       27.0        1393.0
75%            NaN       40.0        2079.0
max            NaN       54.0        8359.0

# Assignment 2: Exploring DataFrames

Hello!

* Can you quickly inspect the first 5 rows of the transactions data? 

* Then, dive a bit more deeply into the data and check if there are any missing values.
* What about the number of unique dates? I want to make sure we didn’t leave any out.
* Finally, can you report the mean, median, min and max of “transactions”?  I want to check for any anomalies in our data.

In [21]:
transaction.head(5)

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [22]:
transaction.info(show_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [23]:
transaction.describe(include = "all").round()

              date  store_nbr  transactions
count        83488    83488.0       83488.0
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN       27.0        1695.0
std            NaN       16.0         963.0
min            NaN        1.0           5.0
25%            NaN       13.0        1046.0
50%            NaN       27.0        1393.0
75%            NaN       40.0        2079.0
max            NaN       54.0        8359.0

In [440]:
transaction["transactions"].median()

1393.0

In [441]:
transaction["transactions"].max()

8359

In [442]:
transaction["transactions"].min()

5

# Exercise 3 - Accessing DataFrames

Hi, starting to dive deeper into this data.

I noticed that the first row is the only one from 2013-01-01.

* Can you get me a copy of the DataFrame that excludes that row, and only includes “store_nbr” and “transactions”?
* Also, can you report the number of unique store numbers?
* Finally, return the total number of transactions in millions

In [443]:
new_transaction = transaction.loc[1: , ["store_nbr" , "transactions"]]
new_transaction

       store_nbr  transactions
1              1          2111
2              2          2358
3              3          3487
4              4          1922
5              5          1903
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83487 rows x 2 columns]

In [444]:
new_transaction["store_nbr"].nunique()

54

In [445]:
tran_mill = (new_transaction["transactions"].sum()/1000000)
tran_mill

141.478175

In [446]:
print(f"{tran_mill.round()} Millions")

141.0 Millions

# Assignment 4: Dropping Data and Duplicates

Hi there!

Can you:

1. Drop the first row of data? We want it permanently removed. 
2. Drop the date column but not in place
3. Return a dataframe that only includes the last row for each of the stores.

Thanks!

In [447]:
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [448]:
transaction.drop("transactions" , axis = 1 )
transaction

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [449]:
transaction.drop(["date"] , axis = 1 , inplace = False)

       store_nbr  transactions
0             25           770
1              1          2111
2              2          2358
3              3          3487
4              4          1922
...          ...           ...
83483         50          2804
83484         51          1573
83485         52          2255
83486         53           932
83487         54           802

[83488 rows x 2 columns]

In [450]:
transaction

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

# Assignment 5: Missing Data

Hello, 

Can you tell if any dates or prices are missing in the oil dataset?

Then compare the mean of the oil series when filling in with mean vs. filling in with 0.

Thanks!

In [451]:
oil = pd.read_csv("D:/AA/Programming/Data Science/Python/Maven/Data Analysis With Python AND Pandas/Pandas+Course+Resources/Pandas Course Resources/retail/oil.csv")

In [452]:
oil.isna().sum()

date           0
dcoilwtico    43
dtype: int64

In [453]:
oil.info(show_counts = True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [454]:
oil_price = oil["dcoilwtico"]
oil_price

0         NaN
1       93.14
2       92.97
3       93.12
4       93.20
        ...
1213    47.65
1214    46.40
1215    46.46
1216    45.96
1217    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

In [455]:
oil["price"] = oil["dcoilwtico"]
oil.drop("dcoilwtico" , axis = 1 , inplace = True)

In [456]:
oil_price_mean = oil["price"].mean().round()
oil_price_mean

68.0

In [457]:
(oil["price"].fillna(oil_price_mean)).mean().round()

68.0

In [458]:
(oil["price"].fillna(0)).mean().round()

65.0

In [459]:
oil

            date  price
0     2013-01-01    NaN
1     2013-01-02  93.14
2     2013-01-03  92.97
3     2013-01-04  93.12
4     2013-01-07  93.20
...          ...    ...
1213  2017-08-25  47.65
1214  2017-08-28  46.40
1215  2017-08-29  46.46
1216  2017-08-30  45.96
1217  2017-08-31  47.26

[1218 rows x 2 columns]

# Assignment 6: Filtering DataFrames

I need some quick research on store 25:

* First, calculate the percentage of times ALL stores had more than 2000 transactions
* Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
* Finally, sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions

In [460]:
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [461]:
tr_gt2000 = transaction["transactions"].ge(2000)
# transaction["transactions"] >= (2000)
tr_lt2000 = transaction["transactions"].le(2000)
# transaction["transactions"] < (2000)
transaction[tr_2000]

             date  store_nbr  transactions
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
6      2013-01-02          6          2143
8      2013-01-02          8          3250
...           ...        ...           ...
83480  2017-08-15         47          3581
83481  2017-08-15         48          2722
83482  2017-08-15         49          2814
83483  2017-08-15         50          2804
83485  2017-08-15         52          2255

[22289 rows x 3 columns]

In [462]:
tr2000_per = (tr_gt2000 / (transaction["transactions"].count()))*100
tr2000_per

0        0.000000
1        0.001198
2        0.001198
3        0.001198
4        0.000000
           ...
83483    0.001198
83484    0.000000
83485    0.001198
83486    0.000000
83487    0.000000
Name: transactions, Length: 83488, dtype: float64

In [463]:
str_25 = (transaction["store_nbr"] == 25)
tr_str25 = transaction.loc[str_25]
tr_str25

             date  store_nbr  transactions
0      2013-01-01         25           770
22     2013-01-02         25          1038
68     2013-01-03         25           887
114    2013-01-04         25          1054
160    2013-01-05         25          1355
...           ...        ...           ...
83242  2017-08-11         25          2195
83296  2017-08-12         25          1946
83350  2017-08-13         25          1107
83404  2017-08-14         25           935
83458  2017-08-15         25           849

[1615 rows x 3 columns]

In [464]:
tr_str25[["transactions"]].sum()

transactions    1520362
dtype: int64

In [465]:
transaction.loc[str_25 & tr_2000].head()

            date  store_nbr  transactions
1770  2013-02-09         25          3091
1816  2013-02-10         25          3331
1862  2013-02-11         25          2763
2736  2013-03-02         25          2014
3978  2013-03-29         25          2442

In [466]:
transaction.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [467]:
str_31 = (transaction["store_nbr"] == 31)
tr_str31 = transaction[str_31]
tr_str31

             date  store_nbr  transactions
27     2013-01-02         31          1401
73     2013-01-03         31          1126
119    2013-01-04         31          1246
165    2013-01-05         31          1317
211    2013-01-06         31          1468
...           ...        ...           ...
83248  2017-08-11         31          1240
83302  2017-08-12         31          1353
83356  2017-08-13         31          1467
83410  2017-08-14         31          1308
83464  2017-08-15         31          1360

[1678 rows x 3 columns]

Finally, sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions

In [468]:
months = (transaction["date"].str[5:7]).astype("int")
months

0        1
1        1
2        1
3        1
4        1
        ..
83483    8
83484    8
83485    8
83486    8
83487    8
Name: date, Length: 83488, dtype: int32

In [469]:
transaction.loc[transaction["store_nbr"].isin([25 , 31])]

             date  store_nbr  transactions
0      2013-01-01         25           770
22     2013-01-02         25          1038
27     2013-01-02         31          1401
68     2013-01-03         25           887
73     2013-01-03         31          1126
...           ...        ...           ...
83356  2017-08-13         31          1467
83404  2017-08-14         25           935
83410  2017-08-14         31          1308
83458  2017-08-15         25           849
83464  2017-08-15         31          1360

[3293 rows x 3 columns]

In [470]:
mask = ((transaction["date"].str[5:7].astype("int").isin([5,6])) &
        (transaction["store_nbr"].isin([25 , 31])) &
        (transaction["transactions"].le(2000)))
transaction[mask]

             date  store_nbr  transactions
5496   2013-05-01         25           867
5501   2013-05-01         31          1380
5542   2013-05-02         25           732
5547   2013-05-02         31          1192
5588   2013-05-03         25           897
...           ...        ...           ...
80872  2017-06-28         31          1195
80920  2017-06-29         25           693
80926  2017-06-29         31          1307
80974  2017-06-30         25           937
80980  2017-06-30         31          1245

[606 rows x 3 columns]

In [471]:
transaction[mask]["transactions"].sum()

644910

### Solving the excecise with .Query():
#### Finally, sum the transactions for stores 25 and 31, that occurred in May or June, and had less than 2000 transactions

In [472]:
transaction.columns

Index(['date', 'store_nbr', 'transactions'], dtype='object')

In [473]:
transaction.query("store_nbr in [25 , 31] & date.str[6] in ['5' , '6'] & transactions < 2000")

             date  store_nbr  transactions
5496   2013-05-01         25           867
5501   2013-05-01         31          1380
5542   2013-05-02         25           732
5547   2013-05-02         31          1192
5588   2013-05-03         25           897
...           ...        ...           ...
80872  2017-06-28         31          1195
80920  2017-06-29         25           693
80926  2017-06-29         31          1307
80974  2017-06-30         25           937
80980  2017-06-30         31          1245

[606 rows x 3 columns]

# Assignment 7: Sorting DataFrames

Hi there,
* Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
* Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
* Finally, sort the columns in reverse alphabetical order. 

Thanks!

In [474]:
transaction.sort_values('transactions' , ascending = False).head(5)

             date  store_nbr  transactions
52011  2015-12-23         44          8359
71010  2016-12-23         44          8307
16570  2013-12-23         44          8256
33700  2014-12-23         44          8120
16572  2013-12-23         46          8001

In [475]:
sorted_tr = transaction.sort_values(['date' , 'transactions'] , ascending = [True , False])
sorted_tr.head()

          date  store_nbr  transactions
0   2013-01-01         25           770
40  2013-01-02         46          4886
38  2013-01-02         44          4821
39  2013-01-02         45          4208
41  2013-01-02         47          4161

In [476]:
sorted_tr.columns = sorted_tr.columns.sort_values(ascending = False)
sorted_tr

      transactions  store_nbr  date
0       2013-01-01         25   770
40      2013-01-02         46  4886
38      2013-01-02         44  4821
39      2013-01-02         45  4208
41      2013-01-02         47  4161
...            ...        ...   ...
83455   2017-08-15         22   766
83449   2017-08-15         16   742
83465   2017-08-15         32   615
83468   2017-08-15         35   612
83459   2017-08-15         26   534

[83488 rows x 3 columns]

In [477]:
transaction.sort_index( axis = 1 , ascending = 0)

       transactions  store_nbr        date
0               770         25  2013-01-01
1              2111          1  2013-01-02
2              2358          2  2013-01-02
3              3487          3  2013-01-02
4              1922          4  2013-01-02
...             ...        ...         ...
83483          2804         50  2017-08-15
83484          1573         51  2017-08-15
83485          2255         52  2017-08-15
83486           932         53  2017-08-15
83487           802         54  2017-08-15

[83488 rows x 3 columns]

# Assignment 8: Modifying Columns

Just some quick work, but can you send me the transaction data with the columns renamed?

* Rename `transactions` to `transaction_count` and `store_nbr` to `store_number`.
* Reorder the columns so date is first, then store number, then transaction count.

Thanks!

In [478]:
transaction

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

#### solution 1

In [479]:
transaction.columns = ["date" , "transaction_count" , "store_number"]
transaction

             date  transaction_count  store_number
0      2013-01-01                 25           770
1      2013-01-02                  1          2111
2      2013-01-02                  2          2358
3      2013-01-02                  3          3487
4      2013-01-02                  4          1922
...           ...                ...           ...
83483  2017-08-15                 50          2804
83484  2017-08-15                 51          1573
83485  2017-08-15                 52          2255
83486  2017-08-15                 53           932
83487  2017-08-15                 54           802

[83488 rows x 3 columns]

#### solution 2

In [480]:
new_col = ["date" , "transaction_count" , "store_number"]
transaction.columns = ["date" , "transactions" , "store_nbr"]

In [481]:
transaction = transaction.rename(columns = {k:v.capitalize() for k , v in zip(transaction.columns , new_col)})
transaction

             Date  Transaction_count  Store_number
0      2013-01-01                 25           770
1      2013-01-02                  1          2111
2      2013-01-02                  2          2358
3      2013-01-02                  3          3487
4      2013-01-02                  4          1922
...           ...                ...           ...
83483  2017-08-15                 50          2804
83484  2017-08-15                 51          1573
83485  2017-08-15                 52          2255
83486  2017-08-15                 53           932
83487  2017-08-15                 54           802

[83488 rows x 3 columns]

In [482]:
transaction.columns

Index(['Date', 'Transaction_count', 'Store_number'], dtype='object')

In [483]:
transaction.reindex(labels = ["Date" , "Store_number" , "Transaction_count"] , axis = 1)

             Date  Store_number  Transaction_count
0      2013-01-01           770                 25
1      2013-01-02          2111                  1
2      2013-01-02          2358                  2
3      2013-01-02          3487                  3
4      2013-01-02          1922                  4
...           ...           ...                ...
83483  2017-08-15          2804                 50
83484  2017-08-15          1573                 51
83485  2017-08-15          2255                 52
83486  2017-08-15           932                 53
83487  2017-08-15           802                 54

[83488 rows x 3 columns]

# Assignment 9: Column Creation

Just some quick work, but can you send me the transaction data with the columns renamed?

* Create a `pct_to_target` column that divides transactions by 2500.
* Then, create a `met_target` column that returns True if `pct_to_target` is greater than or equal to 1.
* Next, create a `bonus_payable` column that equals 100 if `met_target` is True, and 0 if not. Then sum the bonus payable column.
* Finally, create columns for month and day of week as integers. There is some helper code for these dateparts below.



Thanks!

In [484]:
transaction.columns

Index(['Date', 'Transaction_count', 'Store_number'], dtype='object')

In [485]:
transaction["pct_to_target"] = transaction.loc[: , "Transaction_count"] / 2500
transaction

             Date  Transaction_count  Store_number  pct_to_target
0      2013-01-01                 25           770         0.0100
1      2013-01-02                  1          2111         0.0004
2      2013-01-02                  2          2358         0.0008
3      2013-01-02                  3          3487         0.0012
4      2013-01-02                  4          1922         0.0016
...           ...                ...           ...            ...
83483  2017-08-15                 50          2804         0.0200
83484  2017-08-15                 51          1573         0.0204
83485  2017-08-15                 52          2255         0.0208
83486  2017-08-15                 53           932         0.0212
83487  2017-08-15                 54           802         0.0216

[83488 rows x 4 columns]

In [486]:
transaction["met_target"] = transaction.loc[: , "pct_to_target"].ge(1)
transaction

             Date  Transaction_count  Store_number  pct_to_target  met_target
0      2013-01-01                 25           770         0.0100       False
1      2013-01-02                  1          2111         0.0004       False
2      2013-01-02                  2          2358         0.0008       False
3      2013-01-02                  3          3487         0.0012       False
4      2013-01-02                  4          1922         0.0016       False
...           ...                ...           ...            ...         ...
83483  2017-08-15                 50          2804         0.0200       False
83484  2017-08-15                 51          1573         0.0204       False
83485  2017-08-15                 52          2255         0.0208       False
83486  2017-08-15                 53           932         0.0212       False
83487  2017-08-15                 54           802         0.0216       False

[83488 rows x 5 columns]

In [487]:
transaction["bonus_payable"] = transaction.loc[: , "met_target"].eq(100)
transaction

,Date,Transaction_count,Store_number,pct_to_target,met_target,bonus_payable
0,2013-01-01,25,770,0.0100,False,False
1,2013-01-02,1,2111,0.0004,False,False
2,2013-01-02,2,2358,0.0008,False,False
3,2013-01-02,3,3487,0.0012,False,False
4,2013-01-02,4,1922,0.0016,False,False
...,...,...,...,...,...,...
83483,2017-08-15,50,2804,0.0200,False,False
83484,2017-08-15,51,1573,0.0204,False,False
83485,2017-08-15,52,2255,0.0208,False,False
83486,2017-08-15,53,932,0.0212,False,False
83487,2017-08-15,54,802,0.0216,False,False

In [488]:
transaction["bonus_payable"].sum()

0

In [489]:
transaction["month"] = transaction.loc[: , "Date"].str[5:7].astype('int')

In [490]:
transaction["day_of_week"] = transaction.loc[: , "Date"].str[9:11].astype("int")

In [491]:
transaction.columns = [col.capitalize() for col in transaction.columns]
transaction.head(5)

,Date,Transaction_count,Store_number,Pct_to_target,Met_target,Bonus_payable,Month,Day_of_week
0,2013-01-01,25,770,0.0100,False,False,1,1
1,2013-01-02,1,2111,0.0004,False,False,1,2
2,2013-01-02,2,2358,0.0008,False,False,1,2
3,2013-01-02,3,3487,0.0012,False,False,1,2
4,2013-01-02,4,1922,0.0016,False,False,1,2

# Assignment 10: np.select

Hi there! I need a few columns created.

1. Create a ‘seasonal_bonus’ column that applies to these dates: 
    * All days in December (month = 12)
    * Sundays (day_of_week = 6) in May (month = 5)
    * Mondays (day_of_week = 0) in July (month = 7)
2. Call the December bonus ‘Holiday Bonus’, the May bonus ‘Corporate Month’, and the July bonus ‘Summer Special’. If no bonus applies, the column should display ‘None’. 
3. Finally, calculate the total bonus owed at $100 per day.

Thanks!

In [492]:
transaction.columns

Index(['Date', 'Transaction_count', 'Store_number', 'Pct_to_target',
       'Met_target', 'Bonus_payable', 'Month', 'Day_of_week'],
      dtype='object')

In [493]:
conditions = [(transaction["Month"] == 12) ,
              (transaction["Month"] == 5) & (transaction["Day_of_week"] == 6) , 
              (transaction["Month"] == 8) & (transaction["Day_of_week"] == 0)]

choices = ["Holiday Bonus" , "Corporate Month" , "Summer Special"]

transaction["seasonal_bonus"] = np.select(conditions , choices , default = "No Sale!")
transaction.columns = [col.lower() for col in transaction.columns]

In [494]:
(transaction["seasonal_bonus"]).value_counts()

seasonal_bonus
No Sale!           76068
Holiday Bonus       6028
Corporate Month      746
Summer Special       646
Name: count, dtype: int64

# Assignment 11: Assign 

* Drop the columns that have been created so far (keep only date, store_number, and transaction count), and recreate them using the assign method.
* Then sum the seasonal bonus owed once again to make sure the numbers are correct.

In [495]:
transaction.columns

Index(['date', 'transaction_count', 'store_number', 'pct_to_target',
       'met_target', 'bonus_payable', 'month', 'day_of_week',
       'seasonal_bonus'],
      dtype='object')

In [496]:
transaction.drop()

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [497]:
# Drop columns we created in prior exercises
transaction = transaction.drop(columns = ["pct_to_target" , "met_target" , "bonus_payable" , "pct_to_target" , 'bonus_payable', 'month', 'day_of_week', 'seasonal_bonus'])
transaction

             date  transaction_count  store_number
0      2013-01-01                 25           770
1      2013-01-02                  1          2111
2      2013-01-02                  2          2358
3      2013-01-02                  3          3487
4      2013-01-02                  4          1922
...           ...                ...           ...
83483  2017-08-15                 50          2804
83484  2017-08-15                 51          1573
83485  2017-08-15                 52          2255
83486  2017-08-15                 53           932
83487  2017-08-15                 54           802

[83488 rows x 3 columns]

In [498]:
transaction

             date  transaction_count  store_number
0      2013-01-01                 25           770
1      2013-01-02                  1          2111
2      2013-01-02                  2          2358
3      2013-01-02                  3          3487
4      2013-01-02                  4          1922
...           ...                ...           ...
83483  2017-08-15                 50          2804
83484  2017-08-15                 51          1573
83485  2017-08-15                 52          2255
83486  2017-08-15                 53           932
83487  2017-08-15                 54           802

[83488 rows x 3 columns]

In [512]:
# Create same columns with assign

choices = ["Holiday Bonus" , "Corporate Month" , "Summer Special"]
transaction.assign(pct_to_target = (transaction.loc[: , "transaction_count"] / 2500)*100,
                   met_target = transaction.loc[: , "pct_to_target"].ge(1))
                   #bonus_payable = transaction.loc[: , "met_target"].eq(100) , 
                   #month = transaction.loc[ : , "date"].str[5:7].astype("int") ,
                   #day_of_week = transaction.loc[ : , "date"].str[7:9].astype("int") , 
                   #seasonal_bonus = np.select(conditions , choices , default = "No Sale!"))

KeyError: 'pct_to_target'

In [403]:
transaction.assign(pct_to_target = (transaction.loc[: , "transaction_count"] / 2500)*100,
                   met_target = transaction.loc[: , "pct_to_target"].ge(1) ,
                   bonus_payable = transaction.loc[: , "met_target"].eq(100) , 
                   month = transaction.loc[ : , "date"].str[5:7].astype("int") ,
                   day_of_week = transaction.loc[ : , "date"].str[7:9].astype("int") , 
                   seasonal_bonus = np.select(conditions , choices , default = "No Sale!")            
                  ).query("(seasonal_bonus == 'No Sale!') & (met_target == 'False')").value_counts()

AttributeError: Can only use .str accessor with string values!

# Assignment 12: Memory Optimization

Reduce the memory usage of the transactions DataFrame to below 5MB.

In [402]:
transaction.head()

,date,transaction_count,store_number,pct_to_target,met_target,bonus_payable,month,day_of_week
0,2013-01-01,25,770,1,True,False,1,0
1,2013-01-02,1,2111,0,False,False,1,0
2,2013-01-02,2,2358,0,False,False,1,0
3,2013-01-02,3,3487,0,False,False,1,0
4,2013-01-02,4,1922,0,False,False,1,0

In [378]:
transaction.info(memory_usage = "deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               83488 non-null  object
 1   transaction_count  83488 non-null  int64
 2   store_number       83488 non-null  int64
 3   pct_to_target      83488 non-null  float64
 4   met_target         83488 non-null  bool
 5   bonus_payable      83488 non-null  bool
 6   month              83488 non-null  int32
 7   day_of_week        83488 non-null  int32
dtypes: bool(2), float64(1), int32(2), int64(2), object(1)
memory usage: 8.0 MB

In [380]:
transaction["transaction_count"].max()
# we should save it as int-8

54

In [381]:
transaction["store_number"].max()
# we should save it as int-16

8359

In [383]:
transaction["pct_to_target"]

0        1.00
1        0.04
2        0.08
3        0.12
4        0.16
         ...
83483    2.00
83484    2.04
83485    2.08
83486    2.12
83487    2.16
Name: pct_to_target, Length: 83488, dtype: float64

In [400]:
transaction = transaction.astype({
    "month" : "int8" ,
    "day_of_week" : "int8" , 
    "transaction_count" : "int8" , 
    "pct_to_target" : "int8" , 
    "store_number" : "int16" , 
    "date" : "datetime64[ns]",
    "seasonal_bonus"
})

In [401]:
transaction.info(memory_usage = "deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   date               83488 non-null  datetime64[ns]
 1   transaction_count  83488 non-null  int8
 2   store_number       83488 non-null  int16
 3   pct_to_target      83488 non-null  int8
 4   met_target         83488 non-null  bool
 5   bonus_payable      83488 non-null  bool
 6   month              83488 non-null  int8
 7   day_of_week        83488 non-null  int8
dtypes: bool(2), datetime64[ns](1), int16(1), int8(4)
memory usage: 1.3 MB

In [414]:
transaction.describe(include = "all").loc[["min" , "max"] , :]

,date,transaction_count,store_number,pct_to_target,met_target,bonus_payable,month,day_of_week
min,2013-01-01 00:00:00,1.0,5.0,0.0,NaN,NaN,1.0,-3.0
max,2017-08-15 00:00:00,54.0,8359.0,2.0,NaN,NaN,12.0,0.0